import { db, schema } from "@nuxthub/db";
import { count } from "drizzle-orm";

const defaultAwardTypes = [
  "国家级及以上一等奖",
  "国家级及以上二等奖",
  "国家级及以上三等奖",
  "国家级及以上第一名",
  "国家级及以上第二名",
  "国家级及以上第三名",
  "国家级及以上第四名",
  "国家级及以上第五名",
  "国家级及以上第六名",
  "国家级及以上其他奖项",
  "国家级及以上推荐参赛未获奖",
  "重要国际比赛获奖",
  "省级一等奖",
  "省级二等奖",
  "省级三等奖",
  "省级第一名",
  "省级第二名",
  "省级第三名",
  "省级第四名",
  "省级第五名",
  "省级第六名",
  "省级其他奖项",
  "省级推荐参赛未获奖",
  "市级一等奖",
  "市级二等奖",
  "市级三等奖",
  "市级第一名",
  "市级第二名",
  "市级第三名",
  "市级第四名",
  "市级第五名",
  "市级第六名",
  "市级其他奖项",
  "市级推荐参赛未获奖",
  "校级一等奖",
  "校级二等奖",
  "校级三等奖",
  "校级第一名",
  "校级第二名",
  "校级第三名",
  "校级第四名",
  "校级第五名",
  "校级第六名",
  "校级其他奖项",
  "学院级推荐参赛未获奖",
  "学院级第一名",
  "学院级第二名",
  "学院级第三名",
  "以第一作者、通讯作者、第二作者（指导教师为第一作者）在专业领域内有较大影响力的期刊或学术会议公开发表学术、科研论文",
  "以第一作者、通讯作者、第二作者（指导教师为第一作者）在专业领域其他期刊或学术会议公开发表学术、 科研论文",
  "获得国内发明专利",
  "获得国际授权发明专利",
  "获得实用新型专利",
  "获得外观型专利",
  "国家授权的软件著作权登记完成人",
  "参加大学生创新创业训练计划项目及科研助手等活动中，被批准立项或正式聘用，且取得一定科研成果，评定等级为优秀",
  "参加大学生创新创业训练计划项目及科研助手等活动中，被批准立项或正式聘用，且取得一定科研成果，评定等级为合格",
];

export default defineNitroPlugin(async () => {
  const [res] = await db.select({ typeCount: count() }).from(schema.awardTypes);

  if (res && res.typeCount === 0) {
    await db
      .insert(schema.awardTypes)
      .values(defaultAwardTypes.map((name) => ({ name })))
      .onConflictDoNothing({ target: schema.awardTypes.name });
  }
});
